### Concatination of series and array

In [1]:
import pandas as pd
import numpy as np

In [2]:
ser1 = pd.Series(np.random.randint(10,30,10))
ser2 = pd.Series(np.random.randint(10,30,10))
ser3 = pd.Series(np.random.randint(10,30,10))

In [3]:
# Concatenate ser1 and ser2
# axis =0 (raw wise)
#axis =1 (column wise)

ans=pd.concat([ser1,ser2])

In [4]:
ans[5]

5    12
5    25
dtype: int32

In [20]:
# concatenate ser1 and ser2 with hierarchial indexing

In [5]:
 ans=pd.concat([ser1,ser2],keys = ['Data1','Data2'])

In [22]:
ans['Data1'][5]

23

In [23]:
ans['Data2'][5]

25

In [24]:
# Concatenate the series with regular indexes (ignoring origional indexes)

In [25]:
pd.concat([ser1,ser2],ignore_index =True)

0     18
1     20
2     17
3     28
4     18
5     23
6     26
7     12
8     11
9     14
10    10
11    11
12    20
13    19
14    18
15    25
16    17
17    21
18    22
19    25
dtype: int32

In [26]:
pd.concat([ser1,ser2],axis =1)

    0   1
0  18  10
1  20  11
2  17  20
3  28  19
4  18  18
5  23  25
6  26  17
7  12  21
8  11  22
9  14  25

In [27]:
pd.concat([ser1,ser2,ser3],axis =1)

    0   1   2
0  18  10  23
1  20  11  22
2  17  20  19
3  28  19  20
4  18  18  11
5  23  25  22
6  26  17  21
7  12  21  24
8  11  22  15
9  14  25  17

In [28]:
pwd

'C:\\Users\\radhika rawat\\ITP oct 23 batch'

In [29]:
data =pd.read_excel('city.xlsx')

In [30]:
data

     name  ITP  NPV
0    ajay   85   87
1    rani   88   86
2  mukesh   75   75
3   ashok   67   34
4  sumit    53   74
5  pankaj   75   45
6  priya    64   37
7   swati   59   64
8  lokesh   89   76

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('data.xlsx',sheet_name=0)
df2 = pd.read_excel('data.xlsx',sheet_name=1)
df3 = pd.read_excel('data.xlsx',sheet_name=2)

In [33]:
df1

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000

In [34]:
df2

   Emp ID  Emp Name       Deptt  Age  Salary
0    1021    Roshan       Sales   32   66000
1    1022  Priyanka       Sales   35   72000
2    1023     Geeta          HR   25   30000
3    1024     Ashok  Operations   33   37000
4    1025      Riya          HR   27   35000

In [35]:
df3

   Emp ID  Emp Name  Dependents  Cars  Property
0    1011      Ajay           3     1         1
1    1012    Mukesh           2     1         0
2    1022  Priyanka           1     0         0
3    1023     Geeta           3     2         1
4    1015      Rita           2     1         1

In [36]:
# concatenate dataframes df1 and df2
pd.concat([df1,df2])

   Emp ID  Emp Name       Deptt  Age  Salary
0    1011      Ajay       Sales   34   75000
1    1012    Mukesh          HR   28   35000
2    1013     Suman          HR   27   35000
3    1014    Neeraj       Sales   30   60000
4    1015      Rita      Market   32   67000
0    1021    Roshan       Sales   32   66000
1    1022  Priyanka       Sales   35   72000
2    1023     Geeta          HR   25   30000
3    1024     Ashok  Operations   33   37000
4    1025      Riya          HR   27   35000

In [37]:
pd.concat([df1,df2],axis=1)

,Emp ID,Emp Name,Deptt,Age,Salary,Emp ID,Emp Name,Deptt,Age,Salary
0,1011,Ajay,Sales,34,75000,1021,Roshan,Sales,32,66000
1,1012,Mukesh,HR,28,35000,1022,Priyanka,Sales,35,72000
2,1013,Suman,HR,27,35000,1023,Geeta,HR,25,30000
3,1014,Neeraj,Sales,30,60000,1024,Ashok,Operations,33,37000
4,1015,Rita,Market,32,67000,1025,Riya,HR,27,35000

In [38]:
# Concatenate df1, df2 and df3
pd.concat([df1,df2,df3])

   Emp ID  Emp Name       Deptt   Age   Salary  Dependents  Cars  Property
0    1011      Ajay       Sales  34.0  75000.0         NaN   NaN       NaN
1    1012    Mukesh          HR  28.0  35000.0         NaN   NaN       NaN
2    1013     Suman          HR  27.0  35000.0         NaN   NaN       NaN
3    1014    Neeraj       Sales  30.0  60000.0         NaN   NaN       NaN
4    1015      Rita      Market  32.0  67000.0         NaN   NaN       NaN
0    1021    Roshan       Sales  32.0  66000.0         NaN   NaN       NaN
1    1022  Priyanka       Sales  35.0  72000.0         NaN   NaN       NaN
2    1023     Geeta          HR  25.0  30000.0         NaN   NaN       NaN
3    1024     Ashok  Operations  33.0  37000.0         NaN   NaN       NaN
4    1025      Riya          HR  27.0  35000.0         NaN   NaN       NaN
0    1011      Ajay         NaN   NaN      NaN         3.0   1.0       1.0
1    1012    Mukesh         NaN   NaN      NaN         2.0   1.0       0.0
2    1022  Priyanka         NaN   NaN      NaN         1.0   0.0       0.0
3    1023     Geeta         NaN   NaN      NaN         3.0   2.0       1.0
4    1015      Rita         NaN   NaN      NaN         2.0   1.0       1.0

In [39]:
pd.concat([df1,df2,df3],axis=1)

,Emp ID,Emp Name,Deptt,Age,Salary,Emp ID,Emp Name,Deptt,Age,Salary,Emp ID,Emp Name,Dependents,Cars,Property
0,1011,Ajay,Sales,34,75000,1021,Roshan,Sales,32,66000,1011,Ajay,3,1,1
1,1012,Mukesh,HR,28,35000,1022,Priyanka,Sales,35,72000,1012,Mukesh,2,1,0
2,1013,Suman,HR,27,35000,1023,Geeta,HR,25,30000,1022,Priyanka,1,0,0
3,1014,Neeraj,Sales,30,60000,1024,Ashok,Operations,33,37000,1023,Geeta,3,2,1
4,1015,Rita,Market,32,67000,1025,Riya,HR,27,35000,1015,Rita,2,1,1

In [40]:
# concatenate df1 and df2 using join = 'inner'

In [41]:
# join = 'outer'means union of column names
# join = 'inner' means intersection of column names
pd.concat([df1,df3],join='inner')

   Emp ID  Emp Name
0    1011      Ajay
1    1012    Mukesh
2    1013     Suman
3    1014    Neeraj
4    1015      Rita
0    1011      Ajay
1    1012    Mukesh
2    1022  Priyanka
3    1023     Geeta
4    1015      Rita

In [42]:
pd.concat([df1,df3],join='outer')

   Emp ID  Emp Name   Deptt   Age   Salary  Dependents  Cars  Property
0    1011      Ajay   Sales  34.0  75000.0         NaN   NaN       NaN
1    1012    Mukesh      HR  28.0  35000.0         NaN   NaN       NaN
2    1013     Suman      HR  27.0  35000.0         NaN   NaN       NaN
3    1014    Neeraj   Sales  30.0  60000.0         NaN   NaN       NaN
4    1015      Rita  Market  32.0  67000.0         NaN   NaN       NaN
0    1011      Ajay     NaN   NaN      NaN         3.0   1.0       1.0
1    1012    Mukesh     NaN   NaN      NaN         2.0   1.0       0.0
2    1022  Priyanka     NaN   NaN      NaN         1.0   0.0       0.0
3    1023     Geeta     NaN   NaN      NaN         3.0   2.0       1.0
4    1015      Rita     NaN   NaN      NaN         2.0   1.0       1.0

### Joining the dataframe

In [3]:
df1

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000

In [5]:
df3

   Emp ID  Emp Name  Dependents  Cars  Property
0    1011      Ajay           3     1         1
1    1012    Mukesh           2     1         0
2    1022  Priyanka           1     0         0
3    1023     Geeta           3     2         1
4    1015      Rita           2     1         1

In [7]:
right_join = pd.merge(df1, df3, on='Emp ID', how='right')
right_join

,Emp ID,Emp Name_x,Deptt,Age,Salary,Emp Name_y,Dependents,Cars,Property
0,1011,Ajay,Sales,34.0,75000.0,Ajay,3,1,1
1,1012,Mukesh,HR,28.0,35000.0,Mukesh,2,1,0
2,1022,NaN,NaN,NaN,NaN,Priyanka,1,0,0
3,1023,NaN,NaN,NaN,NaN,Geeta,3,2,1
4,1015,Rita,Market,32.0,67000.0,Rita,2,1,1

In [7]:
left_join = pd.merge(df1, df3, on='Emp ID', how='left')
print(left_join)

   Emp ID Emp Name_x   Deptt  Age  Salary Emp Name_y  Dependents  Cars  \
0    1011       Ajay   Sales   34   75000       Ajay         3.0   1.0
1    1012     Mukesh      HR   28   35000     Mukesh         2.0   1.0
2    1013      Suman      HR   27   35000        NaN         NaN   NaN
3    1014     Neeraj   Sales   30   60000        NaN         NaN   NaN
4    1015       Rita  Market   32   67000       Rita         2.0   1.0

   Property
0       1.0
1       0.0
2       NaN
3       NaN
4       1.0

In [16]:
df1.merge(df3, how = "inner")

   Emp ID Emp Name   Deptt  Age  Salary  Dependents  Cars  Property
0    1011     Ajay   Sales   34   75000           3     1         1
1    1012   Mukesh      HR   28   35000           2     1         0
2    1015     Rita  Market   32   67000           2     1         1

In [8]:
# perform left join on df1 and df3 (default) on 'EmpID'
df1.set_index('Emp ID').join(df3.set_index('Emp ID'),lsuffix='L')

       Emp NameL   Deptt  Age  Salary Emp Name  Dependents  Cars  Property
Emp ID
1011        Ajay   Sales   34   75000     Ajay         3.0   1.0       1.0
1012      Mukesh      HR   28   35000   Mukesh         2.0   1.0       0.0
1013       Suman      HR   27   35000      NaN         NaN   NaN       NaN
1014      Neeraj   Sales   30   60000      NaN         NaN   NaN       NaN
1015        Rita  Market   32   67000     Rita         2.0   1.0       1.0

In [46]:
df1.set_index('Emp ID').join(df3.set_index('Emp ID'),lsuffix='Left')

       Emp NameLeft   Deptt  Age  Salary Emp Name  Dependents  Cars  Property
Emp ID
1011           Ajay   Sales   34   75000     Ajay         3.0   1.0       1.0
1012         Mukesh      HR   28   35000   Mukesh         2.0   1.0       0.0
1013          Suman      HR   27   35000      NaN         NaN   NaN       NaN
1014         Neeraj   Sales   30   60000      NaN         NaN   NaN       NaN
1015           Rita  Market   32   67000     Rita         2.0   1.0       1.0

In [47]:
df1.set_index(['Emp ID','Emp Name']).join(df3.set_index(['Emp ID','Emp Name']),lsuffix='L')

                  Deptt  Age  Salary  Dependents  Cars  Property
Emp ID Emp Name
1011   Ajay       Sales   34   75000         3.0   1.0       1.0
1012   Mukesh        HR   28   35000         2.0   1.0       0.0
1013   Suman         HR   27   35000         NaN   NaN       NaN
1014   Neeraj     Sales   30   60000         NaN   NaN       NaN
1015   Rita      Market   32   67000         2.0   1.0       1.0

In [48]:
# perform right join on df1 and df3 on 'Email ID'
df1.set_index(['Emp ID','Emp Name']).join(df3.set_index(['Emp ID','Emp Name']),how='right')

                  Deptt   Age   Salary  Dependents  Cars  Property
Emp ID Emp Name
1011   Ajay       Sales  34.0  75000.0           3     1         1
1012   Mukesh        HR  28.0  35000.0           2     1         0
1022   Priyanka     NaN   NaN      NaN           1     0         0
1023   Geeta        NaN   NaN      NaN           3     2         1
1015   Rita      Market  32.0  67000.0           2     1         1

In [49]:
df1.set_index(['Emp ID','Emp Name']).join(df3.set_index(['Emp ID','Emp Name']),how='right')

                  Deptt   Age   Salary  Dependents  Cars  Property
Emp ID Emp Name
1011   Ajay       Sales  34.0  75000.0           3     1         1
1012   Mukesh        HR  28.0  35000.0           2     1         0
1022   Priyanka     NaN   NaN      NaN           1     0         0
1023   Geeta        NaN   NaN      NaN           3     2         1
1015   Rita      Market  32.0  67000.0           2     1         1

In [50]:
# perform inner join on df1 and df3 on 'Email ID'
df1.set_index(['Emp ID','Emp Name']).join(df3.set_index(['Emp ID','Emp Name']),lsuffix='R',how='inner')

                  Deptt  Age  Salary  Dependents  Cars  Property
Emp ID Emp Name
1011   Ajay       Sales   34   75000           3     1         1
1012   Mukesh        HR   28   35000           2     1         0
1015   Rita      Market   32   67000           2     1         1

In [51]:
# perform outer join on df1 and df3 on 'Email ID'
df1.set_index(['Emp ID','Emp Name']).join(df3.set_index(['Emp ID','Emp Name']),lsuffix='R',how='outer')

                  Deptt   Age   Salary  Dependents  Cars  Property
Emp ID Emp Name
1011   Ajay       Sales  34.0  75000.0         3.0   1.0       1.0
1012   Mukesh        HR  28.0  35000.0         2.0   1.0       0.0
1013   Suman         HR  27.0  35000.0         NaN   NaN       NaN
1014   Neeraj     Sales  30.0  60000.0         NaN   NaN       NaN
1015   Rita      Market  32.0  67000.0         2.0   1.0       1.0
1022   Priyanka     NaN   NaN      NaN         1.0   0.0       0.0
1023   Geeta        NaN   NaN      NaN         3.0   2.0       1.0

### Merge the dataframe

In [52]:
# Inner Join dataframe df1 and df3 using merge (default)

df1.merge(df3)

   Emp ID Emp Name   Deptt  Age  Salary  Dependents  Cars  Property
0    1011     Ajay   Sales   34   75000           3     1         1
1    1012   Mukesh      HR   28   35000           2     1         0
2    1015     Rita  Market   32   67000           2     1         1

In [53]:
df1.merge(df3,on =['Emp ID'])

,Emp ID,Emp Name_x,Deptt,Age,Salary,Emp Name_y,Dependents,Cars,Property
0,1011,Ajay,Sales,34,75000,Ajay,3,1,1
1,1012,Mukesh,HR,28,35000,Mukesh,2,1,0
2,1015,Rita,Market,32,67000,Rita,2,1,1

In [54]:
df1

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000

In [55]:
df3

   Emp ID  Emp Name  Dependents  Cars  Property
0    1011      Ajay           3     1         1
1    1012    Mukesh           2     1         0
2    1022  Priyanka           1     0         0
3    1023     Geeta           3     2         1
4    1015      Rita           2     1         1

In [56]:
# left Join dataframe df1 and df3 using merge
df1.merge(df3,how ='left')

   Emp ID Emp Name   Deptt  Age  Salary  Dependents  Cars  Property
0    1011     Ajay   Sales   34   75000         3.0   1.0       1.0
1    1012   Mukesh      HR   28   35000         2.0   1.0       0.0
2    1013    Suman      HR   27   35000         NaN   NaN       NaN
3    1014   Neeraj   Sales   30   60000         NaN   NaN       NaN
4    1015     Rita  Market   32   67000         2.0   1.0       1.0

In [57]:
# right Join dataframe df1 and df3 using merge
df1.merge(df3,how ='right')

   Emp ID  Emp Name   Deptt   Age   Salary  Dependents  Cars  Property
0    1011      Ajay   Sales  34.0  75000.0           3     1         1
1    1012    Mukesh      HR  28.0  35000.0           2     1         0
2    1022  Priyanka     NaN   NaN      NaN           1     0         0
3    1023     Geeta     NaN   NaN      NaN           3     2         1
4    1015      Rita  Market  32.0  67000.0           2     1         1

In [58]:
pd.merge(df1,df3,how='right')

   Emp ID  Emp Name   Deptt   Age   Salary  Dependents  Cars  Property
0    1011      Ajay   Sales  34.0  75000.0           3     1         1
1    1012    Mukesh      HR  28.0  35000.0           2     1         0
2    1022  Priyanka     NaN   NaN      NaN           1     0         0
3    1023     Geeta     NaN   NaN      NaN           3     2         1
4    1015      Rita  Market  32.0  67000.0           2     1         1

In [59]:
# Outer Join dataframe df1 and df2 using merge
df1.merge(df3,how ='outer',indicator=True)

,Emp ID,Emp Name,Deptt,Age,Salary,Dependents,Cars,Property,_merge
0,1011,Ajay,Sales,34.0,75000.0,3.0,1.0,1.0,both
1,1012,Mukesh,HR,28.0,35000.0,2.0,1.0,0.0,both
2,1013,Suman,HR,27.0,35000.0,NaN,NaN,NaN,left_only
3,1014,Neeraj,Sales,30.0,60000.0,NaN,NaN,NaN,left_only
4,1015,Rita,Market,32.0,67000.0,2.0,1.0,1.0,both
5,1022,Priyanka,NaN,NaN,NaN,1.0,0.0,0.0,right_only
6,1023,Geeta,NaN,NaN,NaN,3.0,2.0,1.0,right_only

### Reshape melt()

In [60]:
df1

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000

In [61]:
df1.shape

(5, 5)

In [62]:
# melt-->id, value, var
df1.melt(id_vars=['Emp ID'])

    Emp ID  variable   value
0     1011  Emp Name    Ajay
1     1012  Emp Name  Mukesh
2     1013  Emp Name   Suman
3     1014  Emp Name  Neeraj
4     1015  Emp Name    Rita
5     1011     Deptt   Sales
6     1012     Deptt      HR
7     1013     Deptt      HR
8     1014     Deptt   Sales
9     1015     Deptt  Market
10    1011       Age      34
11    1012       Age      28
12    1013       Age      27
13    1014       Age      30
14    1015       Age      32
15    1011    Salary   75000
16    1012    Salary   35000
17    1013    Salary   35000
18    1014    Salary   60000
19    1015    Salary   67000

In [63]:
df1.melt(id_vars=['Emp ID','Emp Name'],
        value_vars= ['Deptt','Salary'])

   Emp ID Emp Name variable   value
0    1011     Ajay    Deptt   Sales
1    1012   Mukesh    Deptt      HR
2    1013    Suman    Deptt      HR
3    1014   Neeraj    Deptt   Sales
4    1015     Rita    Deptt  Market
5    1011     Ajay   Salary   75000
6    1012   Mukesh   Salary   35000
7    1013    Suman   Salary   35000
8    1014   Neeraj   Salary   60000
9    1015     Rita   Salary   67000

In [64]:
df1.melt(id_vars=['Emp ID','Emp Name'],
        value_vars= ['Deptt','Age'])

   Emp ID Emp Name variable   value
0    1011     Ajay    Deptt   Sales
1    1012   Mukesh    Deptt      HR
2    1013    Suman    Deptt      HR
3    1014   Neeraj    Deptt   Sales
4    1015     Rita    Deptt  Market
5    1011     Ajay      Age      34
6    1012   Mukesh      Age      28
7    1013    Suman      Age      27
8    1014   Neeraj      Age      30
9    1015     Rita      Age      32

In [65]:
df1.melt(id_vars=['Emp ID','Emp Name'])

    Emp ID Emp Name variable   value
0     1011     Ajay    Deptt   Sales
1     1012   Mukesh    Deptt      HR
2     1013    Suman    Deptt      HR
3     1014   Neeraj    Deptt   Sales
4     1015     Rita    Deptt  Market
5     1011     Ajay      Age      34
6     1012   Mukesh      Age      28
7     1013    Suman      Age      27
8     1014   Neeraj      Age      30
9     1015     Rita      Age      32
10    1011     Ajay   Salary   75000
11    1012   Mukesh   Salary   35000
12    1013    Suman   Salary   35000
13    1014   Neeraj   Salary   60000
14    1015     Rita   Salary   67000

In [66]:
df1.melt(value_vars=['Deptt','Salary'])

  variable   value
0    Deptt   Sales
1    Deptt      HR
2    Deptt      HR
3    Deptt   Sales
4    Deptt  Market
5   Salary   75000
6   Salary   35000
7   Salary   35000
8   Salary   60000
9   Salary   67000

In [67]:
df1.melt(id_vars =['Emp ID'],value_vars=['Deptt','Salary'])

   Emp ID variable   value
0    1011    Deptt   Sales
1    1012    Deptt      HR
2    1013    Deptt      HR
3    1014    Deptt   Sales
4    1015    Deptt  Market
5    1011   Salary   75000
6    1012   Salary   35000
7    1013   Salary   35000
8    1014   Salary   60000
9    1015   Salary   67000

In [68]:
#  melt the dataframe by keeping 'Emp ID' and 'Emp Name' as id's rest as variable
df1.melt(id_vars=['Emp ID','Emp Name'])

    Emp ID Emp Name variable   value
0     1011     Ajay    Deptt   Sales
1     1012   Mukesh    Deptt      HR
2     1013    Suman    Deptt      HR
3     1014   Neeraj    Deptt   Sales
4     1015     Rita    Deptt  Market
5     1011     Ajay      Age      34
6     1012   Mukesh      Age      28
7     1013    Suman      Age      27
8     1014   Neeraj      Age      30
9     1015     Rita      Age      32
10    1011     Ajay   Salary   75000
11    1012   Mukesh   Salary   35000
12    1013    Suman   Salary   35000
13    1014   Neeraj   Salary   60000
14    1015     Rita   Salary   67000

In [69]:
df2=pd.DataFrame([['ashok',45,34,43,44],
              ['rahul',43,46,45,39],
             ['ridhi',47,39,45,43],
             ['akash',None,43,39,37]],columns =['name','ITP','NVP','DBMS-1','DBMS-2'])

In [70]:
df2

    name   ITP  NVP  DBMS-1  DBMS-2
0  ashok  45.0   34      43      44
1  rahul  43.0   46      45      39
2  ridhi  47.0   39      45      43
3  akash   NaN   43      39      37

In [71]:
df2.melt(id_vars=['name'],value_name='Marks',var_name='Subject')

     name Subject  Marks
0   ashok     ITP   45.0
1   rahul     ITP   43.0
2   ridhi     ITP   47.0
3   akash     ITP    NaN
4   ashok     NVP   34.0
5   rahul     NVP   46.0
6   ridhi     NVP   39.0
7   akash     NVP   43.0
8   ashok  DBMS-1   43.0
9   rahul  DBMS-1   45.0
10  ridhi  DBMS-1   45.0
11  akash  DBMS-1   39.0
12  ashok  DBMS-2   44.0
13  rahul  DBMS-2   39.0
14  ridhi  DBMS-2   43.0
15  akash  DBMS-2   37.0

In [72]:
#  melt the dataframe by keeping 'Emp ID' and 'Emp Name' as id's and 'Deptt' as variable
df1.melt(id_vars=['Emp ID','Emp Name'],
        value_vars= ['Deptt'])

   Emp ID Emp Name variable   value
0    1011     Ajay    Deptt   Sales
1    1012   Mukesh    Deptt      HR
2    1013    Suman    Deptt      HR
3    1014   Neeraj    Deptt   Sales
4    1015     Rita    Deptt  Market

### Pivot Table

In [73]:
# calculate the total salaries deptt wise

In [8]:
df1

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000

In [9]:
pd.pivot_table(data=df1,values='Salary',index='Deptt',aggfunc='mean')

        Salary
Deptt
HR       35000
Market   67000
Sales    67500

In [10]:
pd.pivot_table(data=df1,values='Salary',index='Deptt',aggfunc='sum')

        Salary
Deptt
HR       70000
Market   67000
Sales   135000

In [77]:
# Calculate the average age of people in deptt

#value= age
# index =deptt
#aggfunc=mean
pd.pivot_table(data=df1,values='Age',index='Deptt',aggfunc='mean')

         Age
Deptt
HR      27.5
Market  32.0
Sales   32.0

In [11]:
import seaborn as sns
data =sns.load_dataset('mpg')

In [12]:
data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [20]:
pd.pivot_table(data=data, index = "cylinders", values = "horsepower", aggfunc="mean")

           horsepower
cylinders
3           99.250000
4           78.281407
5           82.333333
6          101.506024
8          158.300971

In [19]:
# average horsepower of diff cylinder category
data.pivot_table(index ='cylinders',values='horsepower')

           horsepower
cylinders
3           99.250000
4           78.281407
5           82.333333
6          101.506024
8          158.300971

In [81]:
data.pivot_table(index ='cylinders',values='horsepower',columns ='origin')

origin         europe       japan         usa
cylinders
3                 NaN   99.250000         NaN
4           78.311475   75.579710   80.956522
5           82.333333         NaN         NaN
6          113.500000  115.833333   99.671233
8                 NaN         NaN  158.300971

In [82]:
# loading the dataset from external

### crosstable

In [83]:
# passing indexes and columns are mandatory in crosstable

In [15]:
data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [85]:
pd.crosstab(index =data['cylinders'],
           values=data['horsepower'],columns=data['origin'],aggfunc='mean')

origin         europe       japan         usa
cylinders
3                 NaN   99.250000         NaN
4           78.311475   75.579710   80.956522
5           82.333333         NaN         NaN
6          113.500000  115.833333   99.671233
8                 NaN         NaN  158.300971

In [86]:
data = pd.DataFrame({'Gender':['Male','Male','Female','Female','Male','Male','Female'],
                   'Qual':['G','PG','Doc','G','PG','G','G']})

In [87]:
data

   Gender Qual
0    Male    G
1    Male   PG
2  Female  Doc
3  Female    G
4    Male   PG
5    Male    G
6  Female    G

In [88]:
pd.crosstab(index =data['Qual'], columns=data['Gender'])

Gender  Female  Male
Qual
Doc          1     0
G            2     2
PG           0     2

In [89]:
diamonds = sns.load_dataset('diamonds')
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [90]:
# Show the count of cut in each color
# value: blank
# index = colours
#columns=cut
# agg=count(default)

pd.crosstab(index=diamonds['color'],columns=diamonds['cut'])

cut    Ideal  Premium  Very Good  Good  Fair
color
D       2834     1603       1513   662   163
E       3903     2337       2400   933   224
F       3826     2331       2164   909   312
G       4884     2924       2299   871   314
H       3115     2360       1824   702   303
I       2093     1428       1204   522   175
J        896      808        678   307   119

In [91]:
# Show the count of graduate, post graduate and doctartes males and females
pd.crosstab(index =data['Qual'], columns=data['Gender'])

Gender  Female  Male
Qual
Doc          1     0
G            2     2
PG           0     2

In [92]:
import seaborn as sns

In [93]:
data = sns.load_dataset('diamonds')

In [94]:
# Show the count of cut in each color

In [95]:
# Show the average price in cut on the bases of color
pd.crosstab(index=diamonds['cut'],columns=diamonds['color'],values=diamonds['price'],aggfunc='mean')

color,D,E,F,G,H,I,J
cut,,,,,,,
Ideal,2629.094566,2597.550090,3374.939362,3720.706388,3889.334831,4451.970377,4918.186384
Premium,3631.292576,3538.914420,4324.890176,4500.742134,5216.706780,5946.180672,6294.591584
Very Good,3470.467284,3214.652083,3778.820240,3872.753806,4535.390351,5255.879568,5103.513274
Good,3405.382175,3423.644159,3495.750275,4123.482204,4276.254986,5078.532567,4574.172638
Fair,4291.061350,3682.312500,3827.003205,4239.254777,5135.683168,4685.445714,4975.655462

In [96]:
# perform same operation using pivot table
pd.pivot_table(data=diamonds,index='cut',columns='color',values='price',aggfunc='mean')

color,D,E,F,G,H,I,J
cut,,,,,,,
Ideal,2629.094566,2597.550090,3374.939362,3720.706388,3889.334831,4451.970377,4918.186384
Premium,3631.292576,3538.914420,4324.890176,4500.742134,5216.706780,5946.180672,6294.591584
Very Good,3470.467284,3214.652083,3778.820240,3872.753806,4535.390351,5255.879568,5103.513274
Good,3405.382175,3423.644159,3495.750275,4123.482204,4276.254986,5078.532567,4574.172638
Fair,4291.061350,3682.312500,3827.003205,4239.254777,5135.683168,4685.445714,4975.655462

### Duplicates

In [97]:
data = pd.read_csv('dup_data.csv')

In [98]:
del data['Unnamed: 0']

In [99]:
data

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000
5    1013    Suman      HR   27   35000
6    1014   Neeraj   Sales   30   60000

In [100]:
 df=data.sort_index(axis=1,ascending=False)
df

   Salary Emp Name  Emp ID   Deptt  Age
0   75000     Ajay    1011   Sales   34
1   35000   Mukesh    1012      HR   28
2   35000    Suman    1013      HR   27
3   60000   Neeraj    1014   Sales   30
4   67000     Rita    1015  Market   32
5   35000    Suman    1013      HR   27
6   60000   Neeraj    1014   Sales   30

In [101]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [102]:
data[data.duplicated()]

   Emp ID Emp Name  Deptt  Age  Salary
5    1013    Suman     HR   27   35000
6    1014   Neeraj  Sales   30   60000

In [103]:
data[data.duplicated(keep='last')]

   Emp ID Emp Name  Deptt  Age  Salary
2    1013    Suman     HR   27   35000
3    1014   Neeraj  Sales   30   60000

In [104]:
data[data.duplicated(keep=False)]

   Emp ID Emp Name  Deptt  Age  Salary
2    1013    Suman     HR   27   35000
3    1014   Neeraj  Sales   30   60000
5    1013    Suman     HR   27   35000
6    1014   Neeraj  Sales   30   60000

In [105]:
data[data.duplicated(subset=['Deptt','Salary'])]

   Emp ID Emp Name  Deptt  Age  Salary
2    1013    Suman     HR   27   35000
5    1013    Suman     HR   27   35000
6    1014   Neeraj  Sales   30   60000

In [106]:
data[data.duplicated(subset=['Deptt','Salary'])]

   Emp ID Emp Name  Deptt  Age  Salary
2    1013    Suman     HR   27   35000
5    1013    Suman     HR   27   35000
6    1014   Neeraj  Sales   30   60000

In [107]:
data.drop_duplicates(keep='last')

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
4    1015     Rita  Market   32   67000
5    1013    Suman      HR   27   35000
6    1014   Neeraj   Sales   30   60000

In [108]:
# Show the duplicated rows in data (keep={'first','last',False})
data[data.duplicated(keep='first')]

   Emp ID Emp Name  Deptt  Age  Salary
5    1013    Suman     HR   27   35000
6    1014   Neeraj  Sales   30   60000

In [109]:
# Show the datasets after droping the duplicates
data.drop_duplicates()

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000

### Map and replace

In [110]:
# map all the values in deptt by new values

In [111]:
data

   Emp ID Emp Name   Deptt  Age  Salary
0    1011     Ajay   Sales   34   75000
1    1012   Mukesh      HR   28   35000
2    1013    Suman      HR   27   35000
3    1014   Neeraj   Sales   30   60000
4    1015     Rita  Market   32   67000
5    1013    Suman      HR   27   35000
6    1014   Neeraj   Sales   30   60000

In [112]:
data.replace({'HR':'Human Resource'})

   Emp ID Emp Name           Deptt  Age  Salary
0    1011     Ajay           Sales   34   75000
1    1012   Mukesh  Human Resource   28   35000
2    1013    Suman  Human Resource   27   35000
3    1014   Neeraj           Sales   30   60000
4    1015     Rita          Market   32   67000
5    1013    Suman  Human Resource   27   35000
6    1014   Neeraj           Sales   30   60000

In [113]:
# replace all Human Resource with HR
# market:2014
#sales:2113
# HR :2789

In [114]:
data['Deptt']=data['Deptt'].map({'Market':2014,'Sales':2113,'HR':2789})
data

   Emp ID Emp Name  Deptt  Age  Salary
0    1011     Ajay   2113   34   75000
1    1012   Mukesh   2789   28   35000
2    1013    Suman   2789   27   35000
3    1014   Neeraj   2113   30   60000
4    1015     Rita   2014   32   67000
5    1013    Suman   2789   27   35000
6    1014   Neeraj   2113   30   60000

### Gropuby

In [18]:
#data['Gender'] = ['Male','Male','Female','Male','Female','Female']

In [19]:
data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [125]:
data.groupby(by=['Gender'])['Gender'].count()

Gender
Female    3
Male      4
Name: Gender, dtype: int64

In [13]:
# Group the data on the basis of gender
data.groupby(['Gender'])['Gender'].count()

KeyError: 'Gender'

In [118]:
data.groupby(by=['Gender'])['Salary'].mean()

Gender
Female    45666.666667
Male      57500.000000
Name: Salary, dtype: float64

In [119]:
data.groupby(by=['Deptt'])['Salary'].sum()

Deptt
2014     67000
2113    195000
2789    105000
Name: Salary, dtype: int64

In [120]:
data.groupby(by=['Deptt','Gender'])['Salary'].mean()

Deptt  Gender
2014   Female    67000.0
2113   Male      65000.0
2789   Female    35000.0
       Male      35000.0
Name: Salary, dtype: float64

In [121]:
data.groupby(by=['Gender','Deptt'])['Salary'].mean()

Gender  Deptt
Female  2014     67000.0
        2789     35000.0
Male    2113     65000.0
        2789     35000.0
Name: Salary, dtype: float64

In [122]:
# Group the data on the basis of deptt and gender
data.groupby(by=['Deptt','Gender'])['Gender'].count()

Deptt  Gender
2014   Female    1
2113   Male      3
2789   Female    2
       Male      1
Name: Gender, dtype: int64